#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Представление = Данные.Наименование + " (На осн." + Данные.ДействуетНаОсновании +")"; 
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)   
	
	СтандартнаяОбработка = Ложь; 
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры
#КонецОбласти